Revit 2024 API
ZoneEquipment.GetZoneEquipmentData Method
 Gets the zone equipment data.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public ZoneEquipmentData GetZoneEquipmentData()
Visual Basic
Public Function GetZoneEquipmentData As ZoneEquipmentData
Visual C++
public:
ZoneEquipmentData^ GetZoneEquipmentData()
See Also
ZoneEquipment Class
Autodesk.Revit.DB.Mechanical Namespace